index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Introducere in circuite electrice si electronice</title>
<!-- 2016-12-01 Jo 14:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Mihai Olteanu" />
</head>
<body>
<div id="content">
<h1 class="title">Introducere in circuite electrice si electronice</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Prefata</h2>
<div class="outline-text-2" id="text-1">
<p>
Carte de fata reprezinta o introducere cat se poate de accesibila
asupra unor subiecte care de multe ori se pradau atat in liceu cat si
la facultate la sectiile cu profil tehnic.  Acele lectii sau cursuri
sunt insa, adesea, croite parca pentru genii, desii impresia mea
formata de-a lungul anilor este ca de cele mai mult ori chiar
profesorii care ar trebui sa aduca lumina in acest domeniu, nu sunt
foarte luminati nici ei. Iar cartile si manualele stufoase existente
nu ajuta nici ele in acest sens. De aici si nevoia cartii de fata,
care isi propune sa elucideze fenomene si concepte fundamentale,
precum curentul, tensiunea, electromagnetismul, rolul rezistentei
intr-un circuit, dar si tranzistori si amplificatoare, folosind
exemple concrete in jurul unui limbaj usor digerabil chiar si de catre
incepatori.
</p>

<p>
Pentru ca asa este frumos, voi mentiona ca lucrarea de fata este o
traducere din limba engleza a cartii <a href="https://www.ibiblio.org/kuphaldt/electricCircuits/">Lessons in Electric Circuits</a>, de
Tony R. Kuphaldt si este publicata sub licenta <a href="https://www.ibiblio.org/kuphaldt/electricCircuits/Devel/dsl.html">DSL</a>.
</p>

<p>
De-a lungul anilor am avut ocazia sa-mi confirm faptul ca cea mai buna
metoda de a invata este de a experimenta pe cont propriu. Desigur,
teoria isi are locul ei incontestabil, dar cativa rezistori si doua
LED-uri pot foarte rapid sa-ti cimenteze conceptele invatate.  Asadar,
iti recomand, daca ai ocazia, sa-ti achizionezi cateva componente de
baza, precum un multimetru, un breadboard, cativa rezistori, cateve
LED-uri, condensatori, o baterie.  Desigur, pare infricosator la
inceput, dar nu o sa dai foc la casa in caze ca nu-ti iese din
prima. In cel mai rau caz ai sa arzi un LED. Asta va fi prima ta
lectie, si, dupa cum vei vedea mult mai incolo, cea mai valoroasa.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Capitole</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-0-1" class="outline-4">
<h4 id="sec-2-0-1"><a href="cc.html">Curent continuu</a></h4>
</div>
<div id="outline-container-sec-2-0-2" class="outline-4">
<h4 id="sec-2-0-2"><a href="ca.html">Curent alternativ</a></h4>
</div>
<div id="outline-container-sec-2-0-3" class="outline-4">
<h4 id="sec-2-0-3"><a href="ea.html">Electronica analogica</a></h4>
</div>
<div id="outline-container-sec-2-0-4" class="outline-4">
<h4 id="sec-2-0-4"><a href="ed.html">Electronica digitala</a></h4>
</div>
<div id="outline-container-sec-2-0-5" class="outline-4">
<h4 id="sec-2-0-5"><a href="exp.html">Experimente</a></h4>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Descarca PDF si HTML</h2>
<div class="outline-text-2" id="text-3">
<p>
Mai jos am pregatit toate capitolele in format html, cat si pdf in caz
ca vrei sa accesezi continutul offline sau poate vrei sa-l printezi si
sa-l ai la indemana tot timpul. Vei avea nevoie de programul 7zip
pentru extragerea arhivei.
</p>

<p>
<a href="circuite.tar.gz">Descarca</a>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Codul sursa</h2>
<div class="outline-text-2" id="text-4">
<p>
Daca te pricepi, sau vrei sa te pricepi, proiectul de fata se
regaseste pe <a href="https://github.com/mihaiolteanu/circuiteelectrice">Github</a>. Poti copia, modifica, sau face ce doresti cu
acest continut, atata timp cat respecti licenta DSL.  Printre altele,
sa mentionezi sursa de unde ai preluat continutul. Desigur, in cazul
in care consideri ca poti aduce imbunatatiri continutului, o poti face
printr-un <a href="https://help.github.com/articles/about-pull-requests/">PR</a> sau printr-un <a href="https://github.com/mihaiolteanu/circuiteelectrice/issues">New Issue</a>, sau imi poti trimite un mail.
</p>

<p>
Intregul continut este sub forma de fisiere org-mode. Aceste este un
tip de continut folosit de <a href="https://www.gnu.org/software/emacs/">Emacs</a>. Seamana cu fisierele de tip text,
dar contine si adnotari care sunt folosite fie pentru a naviga mai
facil in interiorul fisierului dar si pentru a genera un alt tip de
continut bazat pe aceste fisiere org-mode. Asadar, folosind un mic
shell script, se genereaza automate fisiere html din aceste fisiere
org-mode. Iar din fisierele html se genereaza, tot automat, si
PDF-urile. Prin urmare, daca ai Linux si vrei sa incerci (nu stiu pe
Windows cum ar putea functiona toata treaba asta, probabil cu
<a href="https://babun.github.io/">babun</a>?!), doar trebuie sa copiezi proiectul local si apoi sa lansezi
script-ul de care aminteam mai sus:
</p>
<pre class="example">
$ git clone https://github.com/mihaiolteanu/circuiteelectrice
$ ./setup.sh
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mihai Olteanu</p>
<p class="date">Created: 2016-12-01 Jo 14:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
